Repository: Gesi12340/AI-Plant-Disease-Detector
Catalog: mobile_app/lib/l10n/app_*.arb
Languages: sw

# appTitle
source: Plant Doctor
sw: Daktari wa Mimea

# loginTitle
source: Welcome Back
sw: Karibu Tena

# loginSubtitle
source: Login to your account
sw: Ingia kwenye akaunti yako

# usernameLabel
source: Username
sw: Jina la Mtumiaji

# loginButton
source: Login
sw: Ingia

# homeTitle
source: Plant Doctor
sw: Daktari wa Mimea

source: Scan Plant
sw: Chunguza Mmea

# scanSubtitle
source: Take a photo to analyze
sw: Piga picha kuchunguza

source: History
sw: Historia

# historySubtitle
source: View past scans
sw: Angalia vipimo vya zamani

source: Profile
sw: Wasifu

# profileSubtitle
source: User settings
sw: Mipangilio ya mtumiaji

source: Recent Scans
sw: Vipimo vya Hivi Karibuni

source: Diagnosis Result
sw: Matokeo ya Uchunguzi

source: Confidence
sw: Uhakika

source: Severity
sw: Ukali

source: Treatment Recommendation
sw: Mapendekezo ya Tiba

# healthyPlantMessage
source: No treatment needed. Keep maintaining good practices!
sw: Hakuna tiba inayohitajika. Endelea kutunza mmea vizuri!

# infectedPlantMessage
source: 1. Remove infected leaves immediately. 2. Apply copper-based fungicide. 3. Ensure better air circulation.
sw: 1. Ondoa majani yaliyoathirika mara moja. 2. Tumia dawa ya ukungu yenye shaba. 3. Hakikisha mzunguko bora wa hewa.

source: Sync
sw: Oanisha

source: Start Sync
sw: Anza Kuoanisha

source: Sync Complete
sw: Uoanishaji Umekamilika

source: Sync Failed
sw: Uoanishaji Umeshindwa

# noConnection
source: No Internet Connection
sw: Hakuna Mtandao

source: Disease Trends
sw: Mwenendo wa Magonjwa

# noDataChart
source: No data for chart
sw: Hakuna data ya chati

# noHistory
source: No history yet
sw: Hakuna historia bado

# educationTitle
source: Plant Education
sw: Elimu ya Mimea

# learnTab
source: Learn
sw: Jifunze

# quizTab
source: Quiz
sw: Maswali

# tapToLearn
source: Tap to learn more
sw: Gusa kujifunza zaidi

source: Symptoms:
sw: Dalili:

source: Prevention:
sw: Kinga:

source: Quiz Completed!
sw: Maswali yamekamilika!

source: Score:
sw: Alama:

source: Restart Quiz
sw: Anza Tena

source: Question
sw: Swali
